zpq001/mdr32f9q-ps200w/source/src/systemfunc.c
/*******************************************************************
	Module systemfunc.c
	
		Functions for system control.
		

********************************************************************/


#include "MDR32Fx.h"
#include "MDR32F9Qx_rst_clk.h"
#include "MDR32F9Qx_ssp.h"
#include "MDR32F9Qx_uart.h"
#include "MDR32F9Qx_port.h"
#include "MDR32F9Qx_timer.h"
#include "MDR32F9Qx_i2c.h"
#include "MDR32F9Qx_adc.h"
#include "MDR32F9Qx_dma.h"

#include "systemfunc.h"
#include "defines.h"
#include "systick.h"
#include "lcd_1202.h"
#include "guiGraphHAL.h"
#include "guiFonts.h"
#include "guiGraphPrimitives.h"
#include "eeprom.h"

#include "dwt_delay.h"

#include "control.h"
#include "led.h"
#include "dispatcher.h"
#include "converter_hw.h"

//#include "fonts.h"


extern DMA_CtrlDataTypeDef DMA_ControlTable[];
void DMA_CtrlDataInit(DMA_CtrlDataInitTypeDef *DMA_ctrl_data_ptr, DMA_CtrlDataTypeDef *DMA_ctrl_table_ptr);


uint8_t analyze_shutdown = 0;


// Globally initializes DMA controller
void my_DMA_GlobalInit(void)
{
	/* Check the CTRL_BASE_PTR initialisation */
	// MDR_DMA->ALT_CTRL_BASE_PTR is automatically updated by DMA itself and is accessible for read only
	MDR_DMA->CTRL_BASE_PTR = (uint32_t)DMA_ControlTable;
	/* DMA configuration register */
	//MDR_DMA->CFG = DMA_CFG_MASTER_ENABLE || 0 /*DMA_InitStruct->DMA_ProtCtrl*/;		// CHECKME
	MDR_DMA->CFG = DMA_CFG_MASTER_ENABLE | DMA_AHB_Privileged;
}

// Operates similar to SPL function DMA_Init(), but:
//	- Disables channel before init
//	- Does NOT start the channel
//  - Does not modify general DMA controller registers
//	- DMA_ChannelInitStruct.ProtCtrl is unused
void my_DMA_ChannelInit(uint8_t DMA_Channel, DMA_ChannelInitTypeDef* DMA_InitStruct)
{
	// Make sure channel is disabled
	MDR_DMA->CHNL_ENABLE_CLR = (1 << DMA_Channel);

	/* Primary Control Data Init */
	if (DMA_InitStruct->DMA_PriCtrlData)
	{
		DMA_CtrlDataInit(DMA_InitStruct->DMA_PriCtrlData, &DMA_ControlTable[DMA_Channel]);
	}

#if (DMA_AlternateData == 1)
	/* Alternate Control Data Init */
	if (DMA_InitStruct->DMA_AltCtrlData)
	{
		uint32_t ptr = (MDR_DMA->ALT_CTRL_BASE_PTR + (DMA_Channel * sizeof(DMA_CtrlDataTypeDef)));
		DMA_CtrlDataInit(DMA_InitStruct->DMA_AltCtrlData, (DMA_CtrlDataTypeDef *)ptr);
	}
#endif

	/* Burst mode */
	if (DMA_InitStruct->DMA_UseBurst == DMA_BurstSet)
	{
		MDR_DMA->CHNL_USEBURST_SET = (1 << DMA_Channel);
	}
	else
	{
		MDR_DMA->CHNL_USEBURST_CLR = (1 << DMA_Channel);
	}

	/* Channel mask clear - enable requests to channel */
	MDR_DMA->CHNL_REQ_MASK_CLR = (1 << DMA_Channel);
  
	/* Primary - Alternate control data structure selection */
	if (DMA_InitStruct->DMA_SelectDataStructure == DMA_CTRL_DATA_PRIMARY)
	{
		MDR_DMA->CHNL_PRI_ALT_CLR = (1 << DMA_Channel);       /* Use Primary */
	}
	else
	{
		MDR_DMA->CHNL_PRI_ALT_SET = (1 << DMA_Channel);       /* Use Alternate */
	}

	/* Channel priority set */
	if (DMA_InitStruct->DMA_Priority == DMA_Priority_High)
	{
		MDR_DMA->CHNL_PRIORITY_SET = (1 << DMA_Channel);      /* High priority */
	}
	else
	{
		MDR_DMA->CHNL_PRIORITY_CLR = (1 << DMA_Channel);      /* Default priority */
	}
}






//-----------------------------------------------------------------//
// Setup clocks
// CPU core clock (HCLK) = 32 MHz clock from 4 MHz HSE
// ADC clock = 4 MHz clock from 4 MHz HSE
//-----------------------------------------------------------------//
void Setup_CPU_Clock(void)
{
	// Enable HSE
	RST_CLK_HSEconfig(RST_CLK_HSE_ON);
	if (RST_CLK_HSEstatus() != SUCCESS)
	{
		while (1) {}	// Trap
	}
	
	//-------------------------------//
	// Setup CPU PLL and CPU_C1_SEL
	// CPU_C1 = HSE,	PLL = x8
	RST_CLK_CPU_PLLconfig(RST_CLK_CPU_PLLsrcHSEdiv1, RST_CLK_CPU_PLLmul8);
	RST_CLK_CPU_PLLcmd(ENABLE);
	if (RST_CLK_CPU_PLLstatus() != SUCCESS)
	{
		while (1) {}	// Trap
	}
	// Setup CPU_C2 and CPU_C3
	// CPU_C3 = CPU_C2
	RST_CLK_CPUclkPrescaler(RST_CLK_CPUclkDIV1);
	// CPU_C2 = CPU PLL output
	RST_CLK_CPU_PLLuse(ENABLE);
	// Switch to CPU_C3
	// HCLK = CPU_C3
	RST_CLK_CPUclkSelection(RST_CLK_CPUclkCPU_C3);
	
	//-------------------------------//
	// Setup ADC clock
	// ADC_C2 = CPU_C1
	RST_CLK_ADCclkSelection(RST_CLK_ADCclkCPU_C1);
	// ADC_C3 = ADC_C2
	RST_CLK_ADCclkPrescaler(RST_CLK_ADCclkDIV1);
	// Enable ADC_CLK
	RST_CLK_ADCclkEnable(ENABLE);
	
	// Update system clock variable
	SystemCoreClockUpdate();
	
	// Enable clock on all ports (macro are defined in systemfunc.h)
	RST_CLK_PCLKcmd(ALL_PORTS_CLK, ENABLE);
	// Enable clock on peripheral blocks used in design
	RST_CLK_PCLKcmd(PERIPHERALS_CLK ,ENABLE);
}


int32_t pr[15];

void HW_NVIC_init(void)
{
	
	// There are 3 bits of priority implemented in MDR32F9Qx device
	// Setting all bits to pre-emption, see link below
	// http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.dui0552a/BABHGEAJ.html
	NVIC_SetPriorityGrouping( 3 );
	
	pr[0] = NVIC_GetPriority(SVCall_IRQn);
	pr[1] = NVIC_GetPriority(PendSV_IRQn);
	pr[2] = NVIC_GetPriority(SysTick_IRQn);
	pr[3] = NVIC_GetPriority(DMA_IRQn);
	pr[4] = NVIC_GetPriority(Timer2_IRQn);

	NVIC_SetPriority(DMA_IRQn,6);
	NVIC_SetPriority(Timer2_IRQn,6);

	pr[0] = NVIC_GetPriority(SVCall_IRQn);
	pr[1] = NVIC_GetPriority(PendSV_IRQn);
	pr[2] = NVIC_GetPriority(SysTick_IRQn);
	pr[3] = NVIC_GetPriority(DMA_IRQn);
	pr[4] = NVIC_GetPriority(Timer2_IRQn);
	
	
}

void HW_NVIC_check(void)
{
	
	pr[0] = NVIC_GetPriority(SVCall_IRQn);
	pr[1] = NVIC_GetPriority(PendSV_IRQn);
	pr[2] = NVIC_GetPriority(SysTick_IRQn);
	
	pr[3] = NVIC_GetPriority(DMA_IRQn);
	pr[4] = NVIC_GetPriority(Timer2_IRQn);
	
}


//-----------------------------------------------------------------//
// Setup IO Ports
//-----------------------------------------------------------------//
void HW_PortInit(void)
{
	PORT_InitTypeDef PORT_InitStructure;
  
	
	PORT_DeInit(MDR_PORTA);
	PORT_DeInit(MDR_PORTB);
	PORT_DeInit(MDR_PORTC);
	PORT_DeInit(MDR_PORTD);
	PORT_DeInit(MDR_PORTE);
	PORT_DeInit(MDR_PORTF);
	
	// default output value is 0
	// Set some outputs the default design values of 1
	//PORT_SetBits(MDR_PORTA, (1<<BUZ1) | (1<<BUZ2) );
	PORT_SetBits(MDR_PORTB, (1<<LGREEN) | (1<<LRED) );
	
