zpq001/mdr32f9q-ps200w/source/src/systemfunc.c
	/*
	   Reset PORT initialization structure parameters values 
  PORT_InitStruct->PORT_Pin        = PORT_Pin_All;
  PORT_InitStruct->PORT_OE         = PORT_OE_IN;
  PORT_InitStruct->PORT_PULL_UP    = PORT_PULL_UP_OFF;
  PORT_InitStruct->PORT_PULL_DOWN  = PORT_PULL_DOWN_OFF;
  PORT_InitStruct->PORT_PD_SHM     = PORT_PD_SHM_OFF;
  PORT_InitStruct->PORT_PD         = PORT_PD_DRIVER;
  PORT_InitStruct->PORT_GFEN       = PORT_GFEN_OFF;
  PORT_InitStruct->PORT_FUNC       = PORT_FUNC_PORT;
  PORT_InitStruct->PORT_SPEED      = PORT_OUTPUT_OFF;
  PORT_InitStruct->PORT_MODE       = PORT_MODE_ANALOG;
	*/
	
	//================= PORTA =================//
	PORT_StructInit(&PORT_InitStructure);
	
	// Typical digital inputs:
	PORT_InitStructure.PORT_Pin   = (1<<OVERLD) | (1<<ENC_BTN);
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	
	// Digital input with pull-up
	PORT_InitStructure.PORT_Pin   = (1<<EEN);
	PORT_InitStructure.PORT_PULL_UP  = PORT_PULL_UP_ON;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	
	// Typical digital outputs:
	PORT_InitStructure.PORT_Pin   = (1<<CLIM_SEL);
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_SLOW;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	
	// Timer outputs to buzzer (TMR1.CH2, TMR1.CH2N)
	PORT_InitStructure.PORT_Pin   = (1<<BUZ1) | (1<<BUZ2);
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_ALTER;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	
	// USART1 pins	
	PORT_StructInit(&PORT_InitStructure);
	// TX pin
	PORT_InitStructure.PORT_Pin   = 1<<TXD1;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_FAST;
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_OVERRID;
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	// RX pin
	PORT_InitStructure.PORT_Pin   = 1<<RXD1;
	PORT_InitStructure.PORT_OE    = PORT_OE_IN;
	PORT_Init(MDR_PORTA, &PORT_InitStructure);
	
	// debug
/*	PORT_StructInit(&PORT_InitStructure);
	PORT_InitStructure.PORT_Pin   = (1<<TXD1) | (1<<RXD1);
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_SLOW;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_Init(MDR_PORTA, &PORT_InitStructure); */

	//================= PORTB =================//
	PORT_StructInit(&PORT_InitStructure);
	
	// Typical digital inputs: buttons and encoder
	PORT_InitStructure.PORT_Pin   = (1<<SB_ESC) | (1<<SB_LEFT) | (1<<SB_RIGHT) | (1<<SB_OK) | (1<<SB_MODE) | (1<<ENCA) | (1<<ENCB) | (1<<PG) ;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_Init(MDR_PORTB, &PORT_InitStructure);
	
	// Power good 
	// TODO: add interrupt
	PORT_InitStructure.PORT_Pin   = (1<<PG) ;
	PORT_Init(MDR_PORTB, &PORT_InitStructure);
	
	// Leds and buttons SB_ON, SB_OFF
	PORT_InitStructure.PORT_Pin   = (1<<LGREEN) | (1<<LRED);
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_SLOW;
	PORT_Init(MDR_PORTB, &PORT_InitStructure);

	
	//================= PORTC =================//
	PORT_StructInit(&PORT_InitStructure);
	
	// LCD Backlight (TMR3.CH1)
	PORT_InitStructure.PORT_Pin   = (1<<LCD_BL);
	PORT_InitStructure.PORT_MODE = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_ALTER;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_SLOW;
	PORT_Init(MDR_PORTC, &PORT_InitStructure);
	
	// I2C
	PORT_InitStructure.PORT_Pin = (1<<SCL) | (1<<SDA);
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_FAST;
	PORT_Init(MDR_PORTC, &PORT_InitStructure);
	
	
	//================= PORTD =================//
	PORT_StructInit(&PORT_InitStructure);
	
	// Analog functions
	PORT_InitStructure.PORT_Pin   = (1<<VREF_P) | (1<<VREF_N) | (1<<TEMP_IN) | (1<<UADC) | (1<<IADC) ;
	PORT_Init(MDR_PORTD, &PORT_InitStructure);
	
	// LCD CLK and CS
	PORT_InitStructure.PORT_Pin   = (1<<LCD_CLK) | (1<<LCD_CS) ;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_ALTER;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_FAST;
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_Init(MDR_PORTD, &PORT_InitStructure);
	
	// MOSI 
	PORT_InitStructure.PORT_Pin   = (1<<LCD_MOSI);
	PORT_InitStructure.PORT_PULL_DOWN = PORT_PULL_DOWN_ON;
	PORT_Init(MDR_PORTD, &PORT_InitStructure);
	

	
	//================= PORTE =================//
	PORT_StructInit(&PORT_InitStructure);
			
	// LCD RST and SEL, Load disable output
	PORT_InitStructure.PORT_Pin   = (1<<LCD_RST) | (1<<LCD_SEL) | (1<<LDIS);
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_FAST;
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_Init(MDR_PORTE, &PORT_InitStructure);

	// cooler PWM output (TMR3.CH3N)
	PORT_InitStructure.PORT_Pin   = (1<<CPWM);
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_OVERRID;
	PORT_Init(MDR_PORTE, &PORT_InitStructure);
	
	// voltage and current PWM outputs (TMR2.CH1N, TMR2.CH3N)
	PORT_InitStructure.PORT_Pin   = (1<<UPWM) | (1<<IPWM);
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_ALTER;
	PORT_Init(MDR_PORTE, &PORT_InitStructure);
	
	
	
	//================= PORTF =================//
	PORT_StructInit(&PORT_InitStructure);
	
	// Feedback channel select, converter enable
	PORT_InitStructure.PORT_Pin   = (1<<EN) | (1<<STAB_SEL) ;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_SLOW;
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_Init(MDR_PORTF, &PORT_InitStructure);
	
	// USART2 functions	
	PORT_StructInit(&PORT_InitStructure);
	// TX pin
	PORT_InitStructure.PORT_Pin   = 1<<TXD2;
	PORT_InitStructure.PORT_MODE  = PORT_MODE_DIGITAL;
	PORT_InitStructure.PORT_SPEED = PORT_SPEED_FAST;
	PORT_InitStructure.PORT_FUNC  = PORT_FUNC_OVERRID;
	PORT_InitStructure.PORT_OE    = PORT_OE_OUT;
	PORT_Init(MDR_PORTF, &PORT_InitStructure);
	// RX pin
	PORT_InitStructure.PORT_Pin   = 1<<RXD2;
	PORT_InitStructure.PORT_OE    = PORT_OE_IN;
	PORT_Init(MDR_PORTF, &PORT_InitStructure);
}


//-----------------------------------------------------------------//
// Setup UART modules
// HCLK = 32 MHz
//
// UART2 CLK = 16 MHz
//-----------------------------------------------------------------//
void HW_UARTInit(void)
{
	BaudRateStatus initStatus;
	UART_InitTypeDef sUART;
	UART_StructInit(&sUART);
	
