zpq001/mdr32f9q-ps200w/source/src/systemfunc.c
	//--------------- UART2 INIT ---------------//
	UART_DeInit(MDR_UART2);
	
	sUART.UART_BaudRate                           = 115200;
	sUART.UART_WordLength                         = UART_WordLength8b;
	sUART.UART_StopBits                           = UART_StopBits1;
	sUART.UART_Parity                             = UART_Parity_No;
	sUART.UART_FIFOMode                           = UART_FIFO_ON;
	sUART.UART_HardwareFlowControl                = (UART_HardwareFlowControl_RXE | UART_HardwareFlowControl_TXE );
	
	UART_BRGInit(MDR_UART2,UART_HCLKdiv1);
	initStatus = UART_Init(MDR_UART2,&sUART);
	UART_Cmd(MDR_UART2,ENABLE);
	
	//--------------- UART1 INIT ---------------//
	UART_DeInit(MDR_UART1);
	
	sUART.UART_BaudRate                           = 115200;
	sUART.UART_WordLength                         = UART_WordLength8b;
	sUART.UART_StopBits                           = UART_StopBits1;
	sUART.UART_Parity                             = UART_Parity_No;
	sUART.UART_FIFOMode                           = UART_FIFO_ON;
	sUART.UART_HardwareFlowControl                = (UART_HardwareFlowControl_RXE | UART_HardwareFlowControl_TXE );
	
	UART_BRGInit(MDR_UART1,UART_HCLKdiv1);
	initStatus = UART_Init(MDR_UART1,&sUART);
	UART_Cmd(MDR_UART1,ENABLE);
	
	//------------ UART DMA features------------//
	UART_DMAConfig(MDR_UART1,UART_IT_FIFO_LVL_8words,UART_IT_FIFO_LVL_8words);		// ?
	UART_DMAConfig(MDR_UART2,UART_IT_FIFO_LVL_8words,UART_IT_FIFO_LVL_8words);		//
	
	/* Enable UART1 DMA Rx and Tx request */
//	UART_DMACmd(MDR_UART1,(UART_DMA_RXE | UART_DMA_TXE), ENABLE);
	/* Enable UART2 DMA Rx and Tx request */
//	UART_DMACmd(MDR_UART2,(UART_DMA_RXE | UART_DMA_TXE), ENABLE);
}

//-----------------------------------------------------------------//
// Setup DMA
// HCLK = 32 MHz
//-----------------------------------------------------------------//
void HW_DMAInit(void)
{
	// Reset all DMA settings
	DMA_DeInit();	
	
	// Vital for proper DMA IRQ function
	// Single requests from ADC?
	MDR_DMA->CHNL_REQ_MASK_SET = 0xFFFFFFFF;	// Disable all requests
	MDR_DMA->CHNL_USEBURST_SET = 0xFFFFFFFF;	// disable sreq[]
	
	// MDR32F9Qx false DMA requests workaround
	// This must be executed next to clock setup
	RST_CLK_PCLKcmd(RST_CLK_PCLK_SSP1 ,ENABLE);
	SSP_BRGInit(MDR_SSP1,SSP_HCLKdiv1);		
	MDR_SSP1->DMACR = 0;					// Reset false requests
	MDR_SSP2->DMACR = 0;
	RST_CLK_PCLKcmd(RST_CLK_PCLK_SSP1 ,DISABLE);
	
	NVIC->ICPR[0] = 0xFFFFFFFF;		// Reset all pending interrupts
	NVIC->ICER[0] = 0xFFFFFFFF;		// Disable all interrupts
	
	my_DMA_GlobalInit();
	
	NVIC_EnableIRQ(DMA_IRQn);
}



//-----------------------------------------------------------------//
// Setup SSP module
// HCLK = 32 MHz
// The information rate is computed using the following formula:
//		F_SSPCLK / ( CPSDVR * (1 + SCR) )
// 3.2 MHz
//-----------------------------------------------------------------//
void HW_SSPInit(void)
{
	SSP_InitTypeDef sSSP;
	SSP_StructInit (&sSSP);

	SSP_BRGInit(MDR_SSP2,SSP_HCLKdiv1);		// F_SSPCLK = HCLK / 1
	
	sSSP.SSP_SCR  = 0x04;		// 0 to 255
	sSSP.SSP_CPSDVSR = 2;		// even 2 to 254
	sSSP.SSP_Mode = SSP_ModeMaster;
	sSSP.SSP_WordLength = SSP_WordLength9b;
	sSSP.SSP_SPH = SSP_SPH_1Edge;
	sSSP.SSP_SPO = SSP_SPO_Low;
	sSSP.SSP_FRF = SSP_FRF_SPI_Motorola;
	sSSP.SSP_HardwareFlowControl = SSP_HardwareFlowControl_SSE;
	SSP_Init (MDR_SSP2,&sSSP);

	SSP_Cmd(MDR_SSP2, ENABLE);
}

//-----------------------------------------------------------------//
// Setup I2C module
// HCLK = 32 MHz
// 125 kHz
//-----------------------------------------------------------------//
void HW_I2CInit(void)
{
	//--------------- I2C INIT ---------------//
I2C_InitTypeDef I2C_InitStruct;
	
	// Enables I2C peripheral
	I2C_Cmd(ENABLE);
	
	// Initialize I2C_InitStruct
	I2C_InitStruct.I2C_ClkDiv = 256;		// 0x0000 to 0xFFFF
	I2C_InitStruct.I2C_Speed = I2C_SPEED_UP_TO_400KHz;

	// Configure I2C parameters
	I2C_Init(&I2C_InitStruct);
}


//-----------------------------------------------------------------//
//	Setup ADC
//	ADC_CLK = 4 MHz
//	ADC single conversion time is ADC_StartDelay + 
//		(29 to 36 ADC clock cycles depending on ADC_DelayGo)
//	ADC clock = 4MHz / 128 = 31.250kHz (T = 32uS)
//-----------------------------------------------------------------//
void HW_ADCInit(void)
{
	ADC_InitTypeDef sADC;
	ADCx_InitTypeDef sADCx;
	
	// ADC Configuration
	// Reset all ADC settings
	ADC_DeInit();
	ADC_StructInit(&sADC);

	sADC.ADC_SynchronousMode      = ADC_SyncMode_Independent;
	sADC.ADC_StartDelay           = 10;
	sADC.ADC_TempSensor           = ADC_TEMP_SENSOR_Enable;
	sADC.ADC_TempSensorAmplifier  = ADC_TEMP_SENSOR_AMPLIFIER_Enable;
	sADC.ADC_TempSensorConversion = ADC_TEMP_SENSOR_CONVERSION_Enable;
	sADC.ADC_IntVRefConversion    = ADC_VREF_CONVERSION_Enable;
	sADC.ADC_IntVRefTrimming      = 1;
	ADC_Init (&sADC);

	// ADC1 Configuration 
	ADCx_StructInit (&sADCx);
	sADCx.ADC_ClockSource      = ADC_CLOCK_SOURCE_ADC;
	sADCx.ADC_SamplingMode     = ADC_SAMPLING_MODE_SINGLE_CONV;
	sADCx.ADC_ChannelSwitching = ADC_CH_SWITCHING_Disable;
	sADCx.ADC_ChannelNumber    = ADC_CH_TEMP_SENSOR;		
	sADCx.ADC_Channels         = 0;
	sADCx.ADC_LevelControl     = ADC_LEVEL_CONTROL_Disable;
	sADCx.ADC_LowLevel         = 0;
	sADCx.ADC_HighLevel        = 0;
	sADCx.ADC_VRefSource       = ADC_VREF_SOURCE_EXTERNAL;
	sADCx.ADC_IntVRefSource    = ADC_INT_VREF_SOURCE_EXACT;
	sADCx.ADC_Prescaler        = ADC_CLK_div_128;
	sADCx.ADC_DelayGo          = 0;		// CHECKME
	ADC1_Init (&sADCx);
	ADC2_Init (&sADCx);

	// Disable ADC interupts
	ADC1_ITConfig((ADCx_IT_END_OF_CONVERSION  | ADCx_IT_OUT_OF_RANGE), DISABLE);
	ADC2_ITConfig((ADCx_IT_END_OF_CONVERSION  | ADCx_IT_OUT_OF_RANGE), DISABLE);

	// ADC1 enable
	ADC1_Cmd (ENABLE);
	ADC2_Cmd (ENABLE);
	
	
	//-------------------//
/*	ADC1_SetChannel(ADC_CH_TEMP_SENSOR);
	ADC1_Start();
	while( ADC_GetFlagStatus(ADC1_FLAG_END_OF_CONVERSION)==RESET );
  temp_adc = ADC1_GetResult();
	
	ADC1_Start();
	while( ADC_GetFlagStatus(ADC1_FLAG_END_OF_CONVERSION)==RESET );
  temp_adc = ADC1_GetResult();
	
