zpq001/mdr32f9q-ps200w/source/src/systemfunc.c
	temp_adc = temp_adc;
	*/
	
}




//-----------------------------------------------------------------//
// Setup Timers
// HCLK = 32 MHz
// TIMER_CLK = HCLK / TIMER_HCLKdivx
// CLK = TIMER_CLK/(TIMER_Prescaler + 1) 
//-----------------------------------------------------------------//
void HW_TimersInit(void)
{
	TIMER_CntInitTypeDef sTIM_CntInit;
	TIMER_ChnInitTypeDef sTIM_ChnInit;
	TIMER_ChnOutInitTypeDef sTIM_ChnOutInit;
	
	//======================= TIMER1 =======================//
	// Timer1		CH2		-> BUZ+
	//				CH2N	-> BUZ-
	// TIMER_CLK = HCLK
	// CLK = 1MHz
	// Default buzzer freq = 1 / 500us = 2kHz
	
	// Initialize timer 1 counter
	TIMER_CntStructInit(&sTIM_CntInit);
	sTIM_CntInit.TIMER_Prescaler                = 0x1F;		// 32MHz / (31 + 1) = 1MHz
	sTIM_CntInit.TIMER_Period                   = 499;		
	TIMER_CntInit (MDR_TIMER1,&sTIM_CntInit);
	
	// Initialize timer 1 channel 2
	TIMER_ChnStructInit(&sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Mode                = TIMER_CH_MODE_PWM;
	sTIM_ChnInit.TIMER_CH_REF_Format          = TIMER_CH_REF_Format6;
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL2;
	sTIM_ChnInit.TIMER_CH_CCR_UpdateMode      = TIMER_CH_CCR_Update_On_CNT_eq_0;
	TIMER_ChnInit(MDR_TIMER1, &sTIM_ChnInit);
	
	// Initialize timer 1 channel 2 output
	TIMER_ChnOutStructInit(&sTIM_ChnOutInit);
	sTIM_ChnOutInit.TIMER_CH_DirOut_Polarity          = TIMER_CHOPolarity_NonInverted;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Source            = TIMER_CH_OutSrc_Only_1;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Mode              = TIMER_CH_OutMode_Output;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Polarity          = TIMER_CHOPolarity_NonInverted;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Source            = TIMER_CH_OutSrc_Only_1;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Mode              = TIMER_CH_OutMode_Output;
	sTIM_ChnOutInit.TIMER_CH_Number                   = TIMER_CHANNEL2;
	TIMER_ChnOutInit(MDR_TIMER1, &sTIM_ChnOutInit);

	// Set default buzzer duty
	MDR_TIMER1->CCR2 = 249;	
  
	// Enable TIMER1 counter clock
	TIMER_BRGInit(MDR_TIMER1,TIMER_HCLKdiv1);

	// Enable TIMER1
	TIMER_Cmd(MDR_TIMER1,ENABLE);
	
	
	
	//======================= TIMER2 =======================//
	// Timer2		CH1N	-> UPWM
	//				CH3N	-> IPWM
	// 				CH2		-> HW control interrupt generation
	// TIMER_CLK = HCLK
	// CLK = 16MHz
	// PWM frequency = 3906.25 Hz (T = 256us)
	// PWM resolution = 12 bit
	
	// Initialize timer 2 counter
	TIMER_CntStructInit(&sTIM_CntInit);
	sTIM_CntInit.TIMER_Prescaler                = 0x1;		// CLK = 16MHz
	sTIM_CntInit.TIMER_Period                   = 0xFFF;	// 16MHz / 4096 = 3906.25 Hz 
	TIMER_CntInit (MDR_TIMER2,&sTIM_CntInit);

	// Initialize timer 2 channels 1,3
	TIMER_ChnStructInit(&sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Mode                = TIMER_CH_MODE_PWM;
	sTIM_ChnInit.TIMER_CH_REF_Format          = TIMER_CH_REF_Format6;
	sTIM_ChnInit.TIMER_CH_CCR_UpdateMode      = TIMER_CH_CCR_Update_On_CNT_eq_0;
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL1;			// voltage
	TIMER_ChnInit(MDR_TIMER2, &sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL3;			// curret
	TIMER_ChnInit(MDR_TIMER2, &sTIM_ChnInit);
	
	// Initialize timer 2 channel 2 - used for HW control interrupt generation
	TIMER_ChnStructInit(&sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Mode                = TIMER_CH_MODE_PWM;
	sTIM_ChnInit.TIMER_CH_REF_Format          = TIMER_CH_REF_Format1;	// REF output = 1 when CNT == CCR
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL2;
	sTIM_ChnInit.TIMER_CH_CCR_UpdateMode      = TIMER_CH_CCR_Update_Immediately;
	TIMER_ChnInit(MDR_TIMER2, &sTIM_ChnInit);
	
	// Initialize timer 2 channels 1,3 output
	TIMER_ChnOutStructInit(&sTIM_ChnOutInit);
	sTIM_ChnOutInit.TIMER_CH_NegOut_Polarity          = TIMER_CHOPolarity_Inverted;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Source            = TIMER_CH_OutSrc_REF;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Mode              = TIMER_CH_OutMode_Output;
	sTIM_ChnOutInit.TIMER_CH_Number                   = TIMER_CHANNEL1;
	TIMER_ChnOutInit(MDR_TIMER2, &sTIM_ChnOutInit);
	sTIM_ChnOutInit.TIMER_CH_Number                   = TIMER_CHANNEL3;
	TIMER_ChnOutInit(MDR_TIMER2, &sTIM_ChnOutInit);
	
	// Set default voltage PWM duty cycle
	MDR_TIMER2->CCR1 = 0;	
	// Set default current PWM duty cycle
	MDR_TIMER2->CCR3 = 0;	
	// Set default CCR for interrupt generation
	MDR_TIMER2->CCR2 = 0;
	
	// Enable interrupts
	TIMER_ITConfig(MDR_TIMER2, TIMER_STATUS_CCR_REF_CH2, ENABLE);
	//TIMER_ITConfig(MDR_TIMER2, TIMER_STATUS_CNT_ZERO, ENABLE);
	
	// Enable TIMER2 counter clock
	TIMER_BRGInit(MDR_TIMER2,TIMER_HCLKdiv1);

	// Enable TIMER2
	TIMER_Cmd(MDR_TIMER2,ENABLE);
	
	
	
	//======================= TIMER3 =======================//
	// Timer3		CH1 	-> LPWM (LCD backlight PWM) 
	//				CH3N	-> CPWM (System cooler PWM)
	// TIMER_CLK = HCLK
	// CLK = 2MHz
	// PWM frequency = 20kHz
	// PWM resolution = 100
	
	// Initialize timer 3 counter
	TIMER_CntStructInit(&sTIM_CntInit);
	sTIM_CntInit.TIMER_Prescaler                = 0xF;		// 2MHz at 32MHz core clk
	sTIM_CntInit.TIMER_Period                   = 99;			// 20kHz at 2MHz
	TIMER_CntInit (MDR_TIMER3,&sTIM_CntInit);
		
	// Initialize timer 3 channel 1
	TIMER_ChnStructInit(&sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL1;
	sTIM_ChnInit.TIMER_CH_Mode                = TIMER_CH_MODE_PWM;
	sTIM_ChnInit.TIMER_CH_REF_Format          = TIMER_CH_REF_Format6;
	sTIM_ChnInit.TIMER_CH_CCR_UpdateMode      = TIMER_CH_CCR_Update_On_CNT_eq_0;
	TIMER_ChnInit(MDR_TIMER3, &sTIM_ChnInit);

	// Initialize timer 3 channel 1 output
	TIMER_ChnOutStructInit(&sTIM_ChnOutInit);
	sTIM_ChnOutInit.TIMER_CH_Number                   = TIMER_CHANNEL1;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Source            = TIMER_CH_OutSrc_REF;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Polarity          = TIMER_CHOPolarity_NonInverted;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Mode              = TIMER_CH_OutMode_Output;
	TIMER_ChnOutInit(MDR_TIMER3, &sTIM_ChnOutInit);

