zpq001/mdr32f9q-ps200w/source/src/systemfunc.c
	// Initialize timer 3 channel 3
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL3;
	TIMER_ChnInit(MDR_TIMER3, &sTIM_ChnInit);
	
	// Initialize timer 3 channel 3 output
	sTIM_ChnOutInit.TIMER_CH_Number           	= TIMER_CHANNEL3;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Source      = TIMER_CH_OutSrc_Only_0;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Mode        = TIMER_CH_OutMode_Input;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Source     	= TIMER_CH_OutSrc_REF;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Polarity   	= TIMER_CHOPolarity_Inverted;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Mode       	= TIMER_CH_OutMode_Output;
	TIMER_ChnOutInit(MDR_TIMER3, &sTIM_ChnOutInit);


	// Set default PWM duty cycle for LCD backlight PWM	
	MDR_TIMER3->CCR1 = 0;
	
	// Set default PWM duty cycle for system cooler PWM
	MDR_TIMER3->CCR3 = 0;

	// Enable TIMER3 counter clock
	TIMER_BRGInit(MDR_TIMER3,TIMER_HCLKdiv1);

	// Enable TIMER3
	TIMER_Cmd(MDR_TIMER3,ENABLE);
	


}






void SetVoltagePWMPeriod(uint16_t new_period)
{
	MDR_TIMER2->CCR1 = new_period;	
}

void SetCurrentPWMPeriod(uint16_t new_period)
{
	MDR_TIMER2->CCR3 = new_period;	
}






void SetCoolerSpeed(uint16_t speed)
{
	MDR_TIMER3->CCR3 = speed;
}





//==============================================================//
// Set LCD backlight intense
// 0 to 100
//==============================================================//
void LcdSetBacklight(uint16_t value)
{
	if (value>100) value = 100;
		MDR_TIMER3->CCR1 = value;
}



void ProcessPowerOff(void)
{
	portBASE_TYPE xHigherPriorityTaskWokenByPost = pdFALSE;
	
	if (analyze_shutdown)
	{
		if (GetACLineStatus() == OFFLINE)
		{	
			// Disable most power-consuming source - converter
			// There is external pull-down that will disable converter
			//MDR_PORTF->OE &= ~(1<<EN);						// input
			//MDR_PORTF->PULL &= ~((1<<EN) | (1<<(EN+16)));	// no pull up/down
			// Set low-level FSM-based converter control to disable output
			cmd_shutdown_to_HWProcess = 1;
			
			// Send message to dispatcher
			xQueueSendToFrontFromISR(xQueueDispatcher, &dispatcher_shutdown_msg, &xHigherPriorityTaskWokenByPost);
			
			// Disable further checks
			analyze_shutdown = 0;
			
			// Force context switching if required
			portEND_SWITCHING_ISR(xHigherPriorityTaskWokenByPost);
		}
	}
	
	
	/*
		__disable_irq();

		SetConverterState(CONVERTER_OFF);		// safe because we're stopping in this function

		//SysTickStop();
		//StopBeep();

		time_delay = DWT_StartDelayUs(5000);

		// Disable power consumers
		//LcdSetBacklight(0);
		SetCoolerSpeed(0);
		SetVoltagePWMPeriod(0);
		SetCurrentPWMPeriod(0);

		// Put power off message
		LCD_FillWholeBuffer(0);
		LCD_SetPixelOutputMode(PIXEL_MODE_REWRITE);
		LCD_SetFont(&font_h10_bold);
		LCD_PrintString("Power OFF", 0, 0, IMAGE_MODE_NORMAL);
		LcdUpdateBothByCore(lcdBuffer);
		
		// Delay is required for converter to completely turn off.
		while(DWT_DelayInProgress(time_delay));

		// Set converter hardware to default
		SetFeedbackChannel(CHANNEL_12V);
		SetCurrentRange(CURRENT_RANGE_LOW); 
		SetOutputLoad(LOAD_ENABLE); 
	
		// Save device settings and profile
		ee_status1 = EE_SaveGlobalSettings();
		ee_status2 = EE_SaveRecentProfile();
		
		// Print EEPROM status messages
		LCD_PrintString("Settings", 96+0, 0, IMAGE_MODE_NORMAL);
		LCD_PrintString("Profile", 96+0, 34, IMAGE_MODE_NORMAL);
		LCD_SetFont(&font_h10);
		
		if (ee_status1 == EE_OK)
			LCD_PrintString("saved OK", 96+25, 12, IMAGE_MODE_NORMAL);
		else
			LCD_PrintString("NOT saved", 96+25, 12, IMAGE_MODE_NORMAL);
		
		if (ee_status2 == EE_OK)
			LCD_PrintString("saved OK", 96+25, 34 + 12, IMAGE_MODE_NORMAL);
		else if (ee_status2 == EE_NOT_REQUIRED)
			LCD_PrintString("not requried", 96+25, 34 + 12, IMAGE_MODE_NORMAL);
		else
			LCD_PrintString("NOT saved", 96+25, 34 + 12, IMAGE_MODE_NORMAL);
		
		LcdUpdateBothByCore(lcdBuffer);
		
		// Wait a bit more
		time_delay = DWT_StartDelayUs(1000000);
		while(DWT_DelayInProgress(time_delay));

		// Disable all ports
		PORT_DeInit(MDR_PORTA);
		PORT_DeInit(MDR_PORTB);
		PORT_DeInit(MDR_PORTC);
		PORT_DeInit(MDR_PORTD);
		PORT_DeInit(MDR_PORTE);
		PORT_DeInit(MDR_PORTF);

		// DIE
		while(1);
		
	} */
}




struct {
	uint32_t stacked_r0;
	uint32_t stacked_r1;
	uint32_t stacked_r2;
	uint32_t stacked_r3;
	uint32_t stacked_r12;
	uint32_t stacked_lr;
	uint32_t stacked_pc;
	uint32_t stacked_psr;
	uint32_t BFAR;
	uint32_t CFSR;
	uint32_t HFSR;
	uint32_t DFSR;
	uint32_t AFSR;
	uint32_t SBC_SHCSR;
} dbg_struct;


// Hard fault handler
// with stack frame location as input parameter
// called from HardFault_Handler in file startup_MDR32F9x.s
void hard_fault_handler_c (unsigned int * hardfault_args)
{

  dbg_struct.stacked_r0 = ((unsigned long) hardfault_args[0]);
  dbg_struct.stacked_r1 = ((unsigned long) hardfault_args[1]);
  dbg_struct.stacked_r2 = ((unsigned long) hardfault_args[2]);
  dbg_struct.stacked_r3 = ((unsigned long) hardfault_args[3]);
 
  dbg_struct.stacked_r12 = ((unsigned long) hardfault_args[4]);
  dbg_struct.stacked_lr = ((unsigned long) hardfault_args[5]);
  dbg_struct.stacked_pc = ((unsigned long) hardfault_args[6]);
  dbg_struct.stacked_psr = ((unsigned long) hardfault_args[7]);
 /*
  printf ("\n\n[Hard fault handler - all numbers in hex]\n");
  printf ("R0 = %x\n", stacked_r0);
  printf ("R1 = %x\n", stacked_r1);
  printf ("R2 = %x\n", stacked_r2);
  printf ("R3 = %x\n", stacked_r3);
  printf ("R12 = %x\n", stacked_r12);
  printf ("LR [R14] = %x  subroutine call return address\n", stacked_lr);
  printf ("PC [R15] = %x  program counter\n", stacked_pc);
  printf ("PSR = %x\n", stacked_psr);
  printf ("BFAR = %x\n", (*((volatile unsigned long *)(0xE000ED38))));
  printf ("CFSR = %x\n", (*((volatile unsigned long *)(0xE000ED28))));
  printf ("HFSR = %x\n", (*((volatile unsigned long *)(0xE000ED2C))));
  printf ("DFSR = %x\n", (*((volatile unsigned long *)(0xE000ED30))));
  printf ("AFSR = %x\n", (*((volatile unsigned long *)(0xE000ED3C))));
  printf ("SCB_SHCSR = %x\n", SCB->SHCSR);
 */
  while (1);
}



